
type.other <- tibble::tribble(
  ~ Name, ~ Description, ~ Min_score, ~ Max_score, ~ Note,
  "明确度", "对分析结果的评估，最终结论是否明确，以及意义所在。", 0, 3, "",
  "陌生度", "此类业务是否已有分析经验，是否已有建立好的工作流", 0, 3, "",
  "复杂度", "是否需要结合多种方法，例如融合多组学角度", 0, 3, "",
  "缺省度", "是否有现成的数据，还是需要额外挖掘公共数据库", 0, 3, "",
  "耗时度", "不考虑复杂性，只考虑机器运行时长", 0, 3, "",
)

type.fix <- tibble::tribble(
  ~ Name, ~ Description, ~ Min_score, ~ Max_score, ~ Note,
  "明确度", "对分析结果的评估，最终结论是否明确，以及意义所在。", 0, 3, "",
  "陌生度", "此类业务是否已有分析经验，是否已有建立好的工作流", 0, 3, "",
  "复杂度", "是否需要结合多种方法，例如融合多组学角度", 0, 3, "",
  "缺省度", "是否有现成的数据，还是需要额外挖掘公共数据库", 0, 3, "",
  "耗时度", "不考虑复杂性，只考虑机器运行时长", 0, 3, ""
)


