
##################################
################################## 

chmod u+x ./material/findSimilar2.py

file1=./order_material/提供给生信组的相关资料-图片重复/2021080401-荧光图/DAPIPKH67.tif
file2=./order_material/提供给生信组的相关资料-图片重复/2021080401-荧光图/SCI+EXO-APOB-100+sh-NC.tif

file1=./order_material/提供给生信组的相关资料-图片重复/C2022070801-g-组化图/2022.09.08-13-22.8.3-09-心纤维化-22.7.13-1-CD34-100x_20.jpg
file2=./order_material/提供给生信组的相关资料-图片重复/C2022070801-g-组化图/2022.09.08-13-22.8.3-09-心纤维化-22.7.13-1-CD34-100x_21

file1="./order_material/提供给生信组的相关资料-图片重复/N2022040102-c柱状图/Figure2.TIF"
file2="./order_material/提供给生信组的相关资料-图片重复/C2022070801-g-组化图/2022.09.08-13-22.8.3-09-心纤维化-22.7.13-1-CD34-100x_20.jpg"

./material/findSimilar2.py -i $file1 -I $file2

##################################
################################## 



